{
  "Name": "evapotranspiration-monitoring",
  "Title": "Evapotranspiration Monitoring Demonstrator for Austria",
  "Description": "**Evapotranspiration Monitoring Demonstrator for Austria**\nThe [UN World Water Report](https://unesdoc.unesco.org/ark:/48223/pf0000388948) draws attention to the increasing water consumption, which affects global food security and economic growth. Understanding hydrological processes, especially evapotranspiration (ET), is crucial for the functionality and sustainability of green spaces and influences water and energy balances. Actual evapotranspiration (ETa) is an important measure of water transfer from the Earth's surface and includes both soil evaporation and plant transpiration.\nThe methodology to perform evapotranspiration estimation is based on the use of [foundation models such as Prithvi](https://unesdoc.unesco.org/ark:/48223/pf0000388948) that performs a regression analysis of Sentinel-2 multispectral bands and climatic ancillary data (temperature, precipitation and other data), to retrieve an estimation of evapotranspiration measurements obtained from ECOSTRESS.\n\nECOSTRESS is showing lower resolution than the input Sentinel-2, which necessitates pre-processing impacting potentially the measurements. Moreover ECOSTRESS is showing some artefacts in its raw format, this has impact on the machine learning prediction and may reduce quality of the desired output.\n\n© 2025 Sistema GmbH. All rights reserved. When using data or information derived from the “High Resolution Evapotranspiration Service” in publications, websites, or other media, please include the following citation: \"Data provided by Sistema GmbH “High Resolution Evapotranspiration service”, part of the [GTIF-AT initiative](https://gtif-austria.info/narratives/evapotranspiration\\_maps).\"",
  "Image": "https://raw.githubusercontent.com/triebnigg/public-narratives/triebnigg/evapotranspiration-monitoring/assets/triebnigg/evapotranspirationcover-1749285117579.png",
  "Provider": [
    {
      "Name": "Sistema",
      "Url": "https://www.sistema.at/applications/technology/"
    }
  ],
  "Resources": [
    {
      "Name": "COG source",
      "Style": "https://workspace-ui-public.gtif-at-get-it.hub-otc.eox.at/api/public/share/public-ebxe9szx-v1/evapotrans_monit/color_table_ET_Austria_simple.json",
      "Bbox": [
        10.040413513663806,
        45.860352891576,
        17.397020060526515,
        49.46746319842481
      ],
      "TimeEntries": [
        {
          "Time": "2024",
          "Assets": [
            {
              "Identifier": "Evapotrans_monit_COG",
              "File": "https://workspace-ui-public.gtif-at-get-it.hub-otc.eox.at/api/public/share/public-ebxe9szx-v1/evapotrans_monit/Austria_mosaic_clipped_3857_COG.tif"
            }
          ]
        }
      ]
    }
  ]
}